---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Domain
source: html/07b258fc-79c0-5544-6c99-1b77b464fbc8.htm
---
# Autodesk.Revit.DB.IConnector.Domain Property

The domain of the connector.

## Syntax (C#)
```csharp
Domain Domain { get; }
```

## Remarks
This property is used to retrieve the domain of the connector.